IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_dev_nrf52.cpp
//BLE_ADVERTISING_DEF(g_AdvInstance);             /**< Advertising module instance. */
NRF_BLE_GATT_DEF(s_Gatt);

static BtDevDatanRF5_t s_BtDevDatanRF5 = {
		0,//0xFF, BLE_CONN_HANDLE_INVALID,
//		BLEAPP_STATE_UNKNOWN, BLEAPP_ROLE_PERIPHERAL, BLE_GAP_ADV_SET_HANDLE_NOT_SET, BLE_CONN_HANDLE_INVALID, -1, -1,
};

static BtDev_t s_BtDevnRF5;

//static volatile bool s_BleStarted = false;

alignas(4) static uint8_t s_BleAppAdvBuff[256];
alignas(4) static BleAdvPacket_t s_BleAppAdvPkt = { 31, 0, s_BleAppAdvBuff};
alignas(4) static BleAdvPacket_t s_BleAppExtAdvPkt = { 255, 0, s_BleAppAdvBuff};

alignas(4) static uint8_t s_BleAppSrBuff[256];
alignas(4) static BleAdvPacket_t s_BleAppSrPkt = { 31, 0, s_BleAppSrBuff};
alignas(4) static BleAdvPacket_t s_BleAppExtSrPkt = { 255, 0, s_BleAppSrBuff};

static ble_gap_adv_data_t s_BleAppAdvData = {
	.adv_data = {s_BleAppAdvBuff, 0},
	.scan_rsp_data = {s_BleAppSrBuff, 0}
};

pm_peer_id_t g_PeerMngrIdToDelete = PM_PEER_ID_INVALID;
//static nrf_ble_gatt_t s_Gatt;                                     /**< GATT module instance. */
#if 0
ble_db_discovery_t s_DbDiscovery = {
	.services = {},
	.srv_count = 0,
	.curr_char_ind = 0,
	.curr_srv_ind = 0,
	.discovery_in_progress = 0,
	.discovery_pending = 0,
	.discoveries_count = 0,
	.conn_handle = BLE_CONN_HANDLE_INVALID
};

NRF_SDH_BLE_OBSERVER(s_DbDiscovery_obs,
                     BLE_DB_DISC_BLE_OBSERVER_PRIO,
                     ble_db_discovery_on_ble_evt, &s_DbDiscovery);
#endif

NRF_BLE_SCAN_DEF(g_Scan);

static ble_gap_scan_params_t s_BleScanParams =
{
#if (NRF_SD_BLE_API_VERSION >= 6)
	1,
	0,
#endif
    1,		// Active scan
#if (NRF_SD_BLE_API_VERSION <= 2)
	0,	// .selective
	NULL,	// .p_whitelist
#endif
#if (NRF_SD_BLE_API_VERSION >= 3)
	0,				// Use whitelist
	1, 				// Report directed advertisement
#endif
	SCAN_INTERVAL,	// Scan interval
	SCAN_WINDOW,	// Scan window
	SCAN_TIMEOUT,	// Scan timeout
};

static uint8_t g_BleScanBuff[BLE_GAP_SCAN_BUFFER_EXTENDED_MAX];

static ble_data_t g_BleScanReportData = {
	.p_data = g_BleScanBuff,
	.len = BLE_GAP_SCAN_BUFFER_EXTENDED_MAX
};

//#endif

/**@brief Bluetooth SIG debug mode Private Key */
__ALIGN(4) __WEAK extern const uint8_t g_lesc_private_key[32] = {
    0xbd,0x1a,0x3c,0xcd,0xa6,0xb8,0x99,0x58,0x99,0xb7,0x40,0xeb,0x7b,0x60,0xff,0x4a,
    0x50,0x3f,0x10,0xd2,0xe3,0xb3,0xc9,0x74,0x38,0x5f,0xc5,0xa3,0xd4,0xf6,0x49,0x3f,
};

__ALIGN(4) static ble_gap_lesc_p256_pk_t    s_lesc_public_key;      /**< LESC ECC Public Key */
__ALIGN(4) static ble_gap_lesc_dhkey_t      s_lesc_dh_key;          /**< LESC ECC DH Key*/
static ble_gap_conn_sec_mode_t s_gap_conn_mode;

BTDEV_STATE BtDevGetState()
{
	return s_BtDevnRF5.State;
}

#if 0
static void BtDevConnLedOff()
{
	if (s_BtDevnRF5.ConnLedPort < 0 || s_BtDevnRF5.ConnLedPin < 0)
		return;

	if (s_BtDevnRF5.ConnLedActLevel)
	{
	    IOPinClear(s_BtDevnRF5.ConnLedPort, s_BtDevnRF5.ConnLedPin);
	}
	else
	{
	    IOPinSet(s_BtDevnRF5.ConnLedPort, s_BtDevnRF5.ConnLedPin);
	}
}

static void BtDevConnLedOn()
{
	if (s_BtDevnRF5.ConnLedPort < 0 || s_BtDevnRF5.ConnLedPin < 0)
		return;

    if (s_BtDevnRF5.ConnLedActLevel)
    {
        IOPinSet(s_BtDevnRF5.ConnLedPort, s_BtDevnRF5.ConnLedPin);
    }
    else
    {
        IOPinClear(s_BtDevnRF5.ConnLedPort, s_BtDevnRF5.ConnLedPin);
    }
}
#endif
bool BtDevNotify(BtGattChar_t *pChar, uint8_t *pData, uint16_t DataLen)
{
	if (s_BtDevnRF5.ConnHdl == BT_GATT_HANDLE_INVALID)
	{
		return false;
	}

	if (pChar->Runtime.bNotify == false)
		return false;

    ble_gatts_hvx_params_t params;

    memset(&params, 0, sizeof(params));
    params.type = BLE_GATT_HVX_NOTIFICATION;
    params.handle = pChar->Runtime.ValHdl;//.value_handle;
    params.p_data = pData;
    params.p_len = &DataLen;

    uint32_t err_code = sd_ble_gatts_hvx(s_BtDevnRF5.ConnHdl, &params);

    return err_code == NRF_SUCCESS;
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
//void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
//{
//    app_error_handler(DEAD_BEEF, line_num, p_file_name);
//}

void BtDevDisconnect()
{
	if (s_BtDevnRF5.ConnHdl != BLE_CONN_HANDLE_INVALID)
    {
		uint32_t err_code = sd_ble_gap_disconnect(s_BtDevnRF5.ConnHdl, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (err_code == NRF_ERROR_INVALID_STATE)
        {
        	s_BtDevnRF5.ConnHdl = BLE_CONN_HANDLE_INVALID;
        }
        else
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

void BleAppGapDeviceNameSet(const char* pDeviceName)
{
    uint32_t                err_code;

    err_code = sd_ble_gap_device_name_set(&s_gap_conn_mode,
                                          (const uint8_t *)pDeviceName,
                                          strlen( pDeviceName ));
    APP_ERROR_CHECK(err_code);
    //ble_advertising_restart_without_whitelist(&g_AdvInstance);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */

static void BtDevGapParamInit(const BtDevCfg_t *pCfg)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;

    switch (pCfg->SecType)
    {
    	case BTDEV_SECTYPE_NONE:
    	    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&s_gap_conn_mode);
    	    break;
		case BTDEV_SECTYPE_STATICKEY_NO_MITM:
		    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&s_gap_conn_mode);
    	    break;
		case BTDEV_SECTYPE_STATICKEY_MITM:
		    BLE_GAP_CONN_SEC_MODE_SET_ENC_WITH_MITM(&s_gap_conn_mode);
    	    break;
		case BTDEV_SECTYPE_LESC_MITM:
			BLE_GAP_CONN_SEC_MODE_SET_LESC_ENC_WITH_MITM(&s_gap_conn_mode);
    	    break;
		case BTDEV_SECTYPE_SIGNED_NO_MITM:
			BLE_GAP_CONN_SEC_MODE_SET_SIGNED_NO_MITM(&s_gap_conn_mode);
    	    break;
		case BTDEV_SECTYPE_SIGNED_MITM:
			BLE_GAP_CONN_SEC_MODE_SET_SIGNED_WITH_MITM(&s_gap_conn_mode);
    	    break;
    }
/*
    if (pBleAppCfg->pDevName != NULL)
    {
    	err_code = sd_ble_gap_device_name_set(&s_gap_conn_mode,
                                          (const uint8_t *) pBleAppCfg->pDevName,
                                          strlen(pBleAppCfg->pDevName));
    	APP_ERROR_CHECK(err_code);
    }

    err_code = sd_ble_gap_appearance_set(pBleAppCfg->Appearance);
    APP_ERROR_CHECK(err_code);
*/
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

//    if (pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT)
//    if (pBleAppCfg->AdvType != BLEADV_TYPE_ADV_NONCONN_IND)
    if (pCfg->Role & BTDEV_ROLE_PERIPHERAL)
    {
		gap_conn_params.min_conn_interval = MSEC_TO_UNITS(pCfg->ConnIntervalMin, UNIT_1_25_MS);// MIN_CONN_INTERVAL;
		gap_conn_params.max_conn_interval = MSEC_TO_UNITS(pCfg->ConnIntervalMax, UNIT_1_25_MS);//MAX_CONN_INTERVAL;
		gap_conn_params.slave_latency     = SLAVE_LATENCY;
		gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

		err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
		APP_ERROR_CHECK(err_code);
    }

   // BtGapInit(pBleAppCfg->Role);
}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

