IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_dev_nrf52.cpp
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(s_BtDevnRF5.ConnHdl, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        //APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
//            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
//            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
        {
/*        	if (g_BleAppData.AppMode == BLEAPP_MODE_NOCONNECT)
        	{
//        		uint32_t ret = ble_advdata_set(&(g_AdvInstance.advdata), &g_BleAppData.SRData);
        		uint32_t err_code = sd_ble_gap_adv_start(&s_AdvParams, BLEAPP_CONN_CFG_TAG);
        	}
        	else
        	   ret_code_t err_code = ble_advertising_start(&g_AdvInstance, BLE_ADV_MODE_SLOW);*/
          //  APP_ERROR_CHECK(err_code);
        }
           // sleep_mode_enter();
            break;
        default:
            break;
    }
}

static void on_adv_error(uint32_t)
{

}

/**@brief Function for the application's SoftDevice event handler.
 *
 * @param[in] p_ble_evt SoftDevice event.
 */
static void on_ble_evt(ble_evt_t const * p_ble_evt)
{
    uint32_t err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    uint16_t role = ble_conn_state_role(p_ble_evt->evt.gap_evt.conn_handle);

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:

        	BtGapAddConnection(p_gap_evt->conn_handle, role,
        					   p_gap_evt->params.connected.peer_addr.addr_type,
        					   (uint8_t*)p_gap_evt->params.connected.peer_addr.addr);

        	//BleConnLedOn();
        	s_BtDevnRF5.ConnHdl = p_ble_evt->evt.gap_evt.conn_handle;
        	//g_BleAppData.bScan = false;
        	s_BtDevnRF5.State = BTDEV_STATE_CONNECTED;
            break;

        case BLE_GAP_EVT_DISCONNECTED:
        	//BleConnLedOff();
        	BtGapDeleteConnection(p_gap_evt->conn_handle);
        	s_BtDevnRF5.ConnHdl = BLE_CONN_HANDLE_INVALID;
        	s_BtDevnRF5.State = BTDEV_STATE_IDLE;
        	BtDevAdvStart();

        	break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            {
            }
            break;
        case BLE_GAP_EVT_PASSKEY_DISPLAY:
        {
            //char passkey[8 + 1];
            //memcpy(passkey, p_ble_evt->evt.gap_evt.params.passkey_display.passkey, 8);
            //passkey[8] = 0;
            // Don't send delayed Security Request if security procedure is already in progress.
           // err_code = app_timer_stop(m_sec_req_timer_id);
           // APP_ERROR_CHECK(err_code);

        	//g_Uart.printf("Passkey: %s\r\n", passkey);
        } break; // BLE_GAP_EVT_PASSKEY_DISPLAY

        //*****
        // This section is required for compatibility with iPhone X series and other devices that has Bluetooth 5 support
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
//            printf("PHY update request.\r\n");
            ble_gap_phys_t const phys =
            {
                /*.tx_phys =*/ BLE_GAP_PHY_AUTO,
                /*.rx_phys =*/ BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_PHY_UPDATE:
        	if (p_ble_evt->evt.gap_evt.params.phy_update.status == 0)
        	{
        		//printf("%x %x\n", p_ble_evt->evt.gap_evt.params.phy_update.rx_phy, p_ble_evt->evt.gap_evt.params.phy_update.tx_phy);
        	}
        	break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
       {
           ble_gap_data_length_params_t dl_params;

//           printf("BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST\r\n");

           // Clearing the struct will effectivly set members to @ref BLE_GAP_DATA_LENGTH_AUTO
           memset(&dl_params, 0, sizeof(ble_gap_data_length_params_t));
           err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
           APP_ERROR_CHECK(err_code);
       } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        {
            uint16_t max_con_int = p_ble_evt->evt.gap_evt.params.conn_param_update.conn_params.max_conn_interval;
            uint16_t min_con_int = p_ble_evt->evt.gap_evt.params.conn_param_update.conn_params.min_conn_interval;

           // m_ble_params_info.con_interval = max_con_int;
            //ble_its_ble_params_info_send(&m_its, &m_ble_params_info);
//            printf("Con params updated: CI %i, %i\r\n", (int)min_con_int, (int)max_con_int);
        } break;
        //*****

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(s_BtDevnRF5.ConnHdl, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_SYS_ATTR_MISSING

        case BLE_GAP_EVT_ADV_SET_TERMINATED:
            if (  p_ble_evt->evt.gap_evt.params.adv_set_terminated.reason == BLE_GAP_EVT_ADV_SET_TERMINATED_REASON_TIMEOUT
                ||p_ble_evt->evt.gap_evt.params.adv_set_terminated.reason == BLE_GAP_EVT_ADV_SET_TERMINATED_REASON_LIMIT_REACHED)
            {
            	// Latest SDK restart advertising automatically.  Therefore this flag should not change
            	s_BtDevnRF5.State = BTDEV_STATE_IDLE;
            	//BtAppAdvTimeoutHandler();
            }
            break;

