IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_dev_nrf52.cpp
/*    if (SecType == BLEAPP_SECTYPE_STATICKEY_MITM ||
    	SecType == BLEAPP_SECTYPE_LESC_MITM ||
		SecType == BLEAPP_SECTYPE_SIGNED_MITM)
    {
    	sec_param.mitm = 1;
    }
*/
    int type = SecKeyExchg & (BTDEV_SECEXCHG_KEYBOARD | BTDEV_SECEXCHG_DISPLAY);
    switch (type)
    {
		case BTDEV_SECEXCHG_KEYBOARD:
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
			break;

		case BTDEV_SECEXCHG_DISPLAY:
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
    			break;
		case (BTDEV_SECEXCHG_KEYBOARD | BTDEV_SECEXCHG_DISPLAY):
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
    }

    if (SecKeyExchg & BTDEV_SECEXCHG_OOB)
    {
    	sec_param.oob = 1;
//    	nfc_ble_pair_init(&g_AdvInstance, NFC_PAIRING_MODE_JUST_WORKS);
    }

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Generate the ECDH key pair and set public key in the peer-manager.
    //err_code = ble_lesc_ecc_keypair_generate_and_set();
    //APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Security Request timer timeout.
 *
 * @details This function will be called each time the Security Request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t err_code;

    if (s_BtDevnRF5.ConnHdl != BLE_CONN_HANDLE_INVALID)
    {
        // Initiate bonding.
        //NRF_LOG_DEBUG("Start encryption\r\n");
        err_code = pm_conn_secure(s_BtDevnRF5.ConnHdl, false);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

bool BtDevAdvManDataSet(uint8_t *pAdvData, int AdvLen, uint8_t *pSrData, int SrLen)
{
	if (s_BtDevnRF5.State != BTDEV_STATE_ADVERTISING && s_BtDevnRF5.State != BTDEV_STATE_IDLE)
	{
		return false;
	}

	BleAdvPacket_t *advpkt;
	BleAdvPacket_t *srpkt;

	if (s_BtDevnRF5.bExtAdv == true)
	{
		advpkt = &s_BleAppExtAdvPkt;
		srpkt = &s_BleAppExtSrPkt;
	}
	else
	{
		advpkt = &s_BleAppAdvPkt;
		srpkt = &s_BleAppSrPkt;
	}

	if (pAdvData)
	{
		int l = AdvLen + 2;
		BleAdvData_t *p = BleAdvDataAllocate(advpkt, BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);

		if (p == NULL)
		{
			return false;
		}
		*(uint16_t *)p->Data = s_BtDevnRF5.VendorId;
		memcpy(&p->Data[2], pAdvData, AdvLen);

		s_BleAppAdvData.adv_data.len = advpkt->Len;
	}

	if (pSrData)
	{
		int l = SrLen + 2;
		BleAdvData_t *p = BleAdvDataAllocate(srpkt, BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);

		if (p == NULL)
		{
			return false;
		}
		*(uint16_t *)p->Data = s_BtDevnRF5.VendorId;
		memcpy(&p->Data[2], pAdvData, AdvLen);

		s_BleAppAdvData.scan_rsp_data.len = srpkt->Len;
	}

	// SDK15 doesn't allow dynamically updating adv data.  Have to stop and re-start advertising
	if (s_BtDevnRF5.State == BTDEV_STATE_ADVERTISING)
	{
		sd_ble_gap_adv_stop(s_BtDevnRF5.AdvHdl);
	}

	uint32_t err = sd_ble_gap_adv_set_configure(&s_BtDevnRF5.AdvHdl, &s_BleAppAdvData, NULL);
//	APP_ERROR_CHECK(err);

	if (s_BtDevnRF5.State == BTDEV_STATE_ADVERTISING)
	{
		s_BtDevnRF5.State = BTDEV_STATE_IDLE;
		BtDevAdvStart();//BLEAPP_ADVMODE_FAST);
	}

#if 0
    int l = min(Len, BLE_GAP_ADV_MAX_SIZE);

    memcpy(g_AdvInstance.manuf_data_array, pData, l);
    uint32_t ret = ble_advdata_set(&(g_AdvInstance.advdata), &g_BleAppData.SRData);
#endif

    return s_BtDevnRF5.State == BTDEV_STATE_ADVERTISING;
}

void BtDevAdvStart()//BLEAPP_ADVMODE AdvMode)
{
	if (s_BtDevnRF5.State == BTDEV_STATE_ADVERTISING || s_BtDevnRF5.ConnHdl != BLE_CONN_HANDLE_INVALID)
		return;

//	g_BleAppData.bAdvertising = true;
#if 1
	uint32_t err_code = sd_ble_gap_adv_start(s_BtDevnRF5.AdvHdl, BLEAPP_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);

#else
//	if (g_BleAppData.AppMode == BLEAPP_MODE_NOCONNECT)
	//if (g_BleAppData.AdvType == BLEADV_TYPE_ADV_NONCONN_IND)
	if (g_BleAppData.Role & BLEAPP_ROLE_BROADCASTER)
	{
		uint32_t err_code = sd_ble_gap_adv_start(g_AdvInstance.adv_handle, g_AdvInstance.conn_cfg_tag);
        APP_ERROR_CHECK(err_code);
	}
	else
	{
		uint32_t err_code = ble_advertising_start(&g_AdvInstance, (ble_adv_mode_t)BLEAPP_ADVMODE_FAST);//AdvMode);
		if (err_code != NRF_SUCCESS)
		{
			 APP_ERROR_CHECK(err_code);
		}
	}
#endif

	s_BtDevnRF5.State = BTDEV_STATE_ADVERTISING;
}

void BtDevAdvStop()
{
	sd_ble_gap_adv_stop(s_BtDevnRF5.AdvHdl);
	s_BtDevnRF5.State = BTDEV_STATE_IDLE;
}

/**@brief Overloadable function for initializing the Advertising functionality.
 */
__WEAK bool BtDevAdvInit(const BtDevCfg_t *pCfg)
{
    uint32_t               err_code;
    ble_advertising_init_t	initdata;
    uint8_t flags = BT_GAP_DATA_TYPE_FLAGS_NO_BREDR;
	BleAdvPacket_t *advpkt;
	BleAdvPacket_t *srpkt;
	uint8_t proptype = 0;

	memset(&s_BtDevDatanRF5.AdvParam, 0, sizeof(ble_gap_adv_params_t));

    //memset(&initdata, 0, sizeof(ble_advertising_init_t));
    //memset(&g_AdvInstance, 0, sizeof(ble_advertising_t));

#if 1

	if (s_BtDevnRF5.bExtAdv == true)
	{
		advpkt = &s_BleAppExtAdvPkt;
		srpkt = &s_BleAppExtSrPkt;
	}
	else
	{
		advpkt = &s_BleAppAdvPkt;
		srpkt = &s_BleAppSrPkt;
	}

	if (pCfg->Role & BTDEV_ROLE_PERIPHERAL)
	{
		if (pCfg->AdvTimeout != 0)
		{
			flags |= BT_GAP_DATA_TYPE_FLAGS_LIMITED_DISCOVERABLE;
		}
		else
		{
			flags |= BT_GAP_DATA_TYPE_FLAGS_GENERAL_DISCOVERABLE;
		}
		s_BtDevDatanRF5.AdvParam.properties.type = pCfg->bExtAdv ?
												BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED :
												BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
	}
	else if (pCfg->Role & BTDEV_ROLE_BROADCASTER)
	{
		s_BtDevDatanRF5.AdvParam.properties.type = pCfg->bExtAdv ?
												BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED :
												BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
	}

	if (BleAdvDataAdd(advpkt, BT_GAP_DATA_TYPE_FLAGS, &flags, 1) == false)
	{
		return false;
	}

    if (pCfg->Appearance != BT_APPEAR_UNKNOWN_GENERIC)
    {
    	if (BleAdvDataAdd(advpkt, BT_GAP_DATA_TYPE_APPEARANCE, (uint8_t*)&pCfg->Appearance, 2) == false)
    	{
    		// Don't care whether we are able to add appearance or not. Appearance is optional.
    		//return false;
    	}
    }

    BleAdvPacket_t *uidadvpkt;

