IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_dev_nrf52.cpp
    if (pCfg->pDevName != NULL)
    {
    	size_t l = strlen(pCfg->pDevName);
    	uint8_t type = BT_GAP_DATA_TYPE_COMPLETE_LOCAL_NAME;
    	size_t mxl = advpkt->MaxLen - advpkt->Len - 2;

    	if (l > 30 || l > mxl)
    	{
    		// Short name
    		type = BT_GAP_DATA_TYPE_SHORT_LOCAL_NAME;
    		l = min((size_t)30, mxl);
    	}

    	if (BleAdvDataAdd(advpkt, type, (uint8_t*)pCfg->pDevName, l) == false)
    	{
    		return false;
    	}

    	uidadvpkt = pCfg->bExtAdv ? advpkt : srpkt;
    }
    else
    {
    	uidadvpkt = advpkt;
    }

    if (pCfg->pAdvUuid != NULL && pCfg->Role & BTDEV_ROLE_PERIPHERAL)
    {
    	/*
    	if (pCfg->pAdvUuid->BaseIdx > 0 && pCfg->pAdvUuid->Type == BT_UUID_TYPE_16)
    	{

    		// Convert custom uuid to 128 bits
			int l = (pCfg->pAdvUuid->Count - 1) * sizeof(BtUuid_t) + sizeof(BtUuidArr_t);
			uint8_t x[l];

			memcpy(x, pCfg->pAdvUuid, l);
			BtUuidArr_t *ua = (BtUuidArr_t*)x;

			ua->Type = BT_UUID_TYPE_128;


			for (int i = 0; i < pCfg->pAdvUuid->Count; i++)
			{
				ble_uuid_t uid = { pCfg->pAdvUuid->Uuid16[i], (uint8_t)(pCfg->pAdvUuid->BaseIdx == 0 ? BLE_UUID_TYPE_BLE : BLE_UUID_TYPE_VENDOR_BEGIN)};

				uint8_t len = 0;
				uint32_t res = sd_ble_uuid_encode(&uid, &len, ua->Uuid128[i]);
				if (res != 0)
				{
					//printf("err %x\n", res);
				}
			}
			if (BleAdvDataAddUuid(uidadvpkt, ua, pCfg->bCompleteUuidList) == false)
			{

			}
    	}
    	else*/
    	{
			if (BleAdvDataAddUuid(uidadvpkt, pCfg->pAdvUuid, pCfg->bCompleteUuidList) == false)
			{

			}
    	}
    }

	if (pCfg->pAdvManData != NULL)
	{
		int l = pCfg->AdvManDataLen + 2;
		BleAdvData_t *p = BleAdvDataAllocate(advpkt, BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);

		if (p == NULL)
		{
			return false;
		}
		*(uint16_t *)p->Data = pCfg->VendorId;
		memcpy(&p->Data[2], pCfg->pAdvManData, pCfg->AdvManDataLen);
	}

	if (pCfg->pSrManData != NULL)
	{
		int l = pCfg->SrManDataLen + 2;
		BleAdvData_t *p = BleAdvDataAllocate(srpkt, BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);

		if (p == NULL)
		{
			return false;
		}
		*(uint16_t *)p->Data = pCfg->VendorId;
		memcpy(&p->Data[2], pCfg->pSrManData, pCfg->SrManDataLen);
	}
	s_BtDevDatanRF5.AdvParam.p_peer_addr 	= NULL;	// Undirected advertisement.
	s_BtDevDatanRF5.AdvParam.interval    	= MSEC_TO_UNITS(pCfg->AdvInterval, UNIT_0_625_MS);
	s_BtDevDatanRF5.AdvParam.duration     	= MSEC_TO_UNITS(pCfg->AdvTimeout, UNIT_10_MS);
    //g_BleAppData.AdvParam.channel_mask[5]	= (7 << 5);	// All channels
	s_BtDevDatanRF5.AdvParam.filter_policy	= BLE_GAP_ADV_FP_ANY;
	s_BtDevDatanRF5.AdvParam.primary_phy 	= BLE_GAP_PHY_1MBPS;
	s_BtDevDatanRF5.AdvParam.secondary_phy	= BLE_GAP_PHY_2MBPS;

	s_BleAppAdvData.adv_data.len = advpkt->Len;
	s_BleAppAdvData.scan_rsp_data.len = srpkt->Len;

    err_code = sd_ble_gap_adv_set_configure(&s_BtDevnRF5.AdvHdl, &s_BleAppAdvData, &s_BtDevDatanRF5.AdvParam);
    APP_ERROR_CHECK(err_code);

#else
//    memset(&g_AdvInstance.adv_params, 0, sizeof(g_AdvInstance.adv_params));
    g_AdvInstance.conn_cfg_tag = BLEAPP_CONN_CFG_TAG;//BLE_CONN_CFG_TAG_DEFAULT;//BLEAPP_CONN_CFG_TAG;
    g_AdvInstance.adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    g_AdvInstance.adv_mode_current = BLE_ADV_MODE_IDLE;
    g_AdvInstance.adv_modes_config.ble_adv_secondary_phy= BLE_GAP_PHY_2MBPS;
    g_AdvInstance.adv_modes_config.ble_adv_primary_phy= BLE_GAP_PHY_1MBPS;
    g_AdvInstance.current_slave_link_conn_handle = BLE_CONN_HANDLE_INVALID;

    g_AdvInstance.adv_params.primary_phy = BLE_GAP_PHY_1MBPS;
    g_AdvInstance.adv_params.secondary_phy = BLE_GAP_PHY_2MBPS;
    g_AdvInstance.evt_handler = on_adv_evt;
    //g_AdvInstance.error_handler = on_adv_error;
    g_AdvInstance.adv_params.p_peer_addr 		= NULL;                             // Undirected advertisement.
    g_AdvInstance.adv_params.filter_policy		= BLE_GAP_ADV_FP_ANY;
    g_AdvInstance.adv_params.interval    		= MSEC_TO_UNITS(pCfg->AdvInterval, UNIT_0_625_MS);
    g_AdvInstance.adv_params.duration     		= MSEC_TO_UNITS(pCfg->AdvTimeout, UNIT_10_MS);
    g_AdvInstance.p_adv_data = &g_AdvInstance.adv_data;
    g_AdvInstance.adv_data.adv_data.p_data = g_AdvInstance.enc_advdata[0];
    g_AdvInstance.adv_data.scan_rsp_data.p_data = g_AdvInstance.enc_scan_rsp_data[0];

	g_AdvInstance.adv_modes_config.ble_adv_fast_enabled  = true;
	g_AdvInstance.adv_modes_config.ble_adv_extended_enabled = pCfg->bExtAdv;
	g_AdvInstance.adv_modes_config.ble_adv_fast_interval = MSEC_TO_UNITS(pCfg->AdvInterval, UNIT_0_625_MS);
	g_AdvInstance.adv_modes_config.ble_adv_fast_timeout  = MSEC_TO_UNITS(pCfg->AdvTimeout, UNIT_10_MS);

	if (pCfg->AdvSlowInterval > 0)
	{
		g_AdvInstance.adv_modes_config.ble_adv_slow_enabled  = true;
		g_AdvInstance.adv_modes_config.ble_adv_slow_interval = MSEC_TO_UNITS(pCfg->AdvSlowInterval, UNIT_0_625_MS);
		g_AdvInstance.adv_modes_config.ble_adv_slow_timeout  = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;
	}

	g_AdvInstance.adv_modes_config.ble_adv_extended_enabled = pCfg->bExtAdv;

	if (pCfg->bExtAdv == true)
    {
    	if (pCfg->Role & BLEAPP_ROLE_BROADCASTER)
    	{
    		g_AdvInstance.adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
    	}
    	if (pCfg->Role & BLEAPP_ROLE_PERIPHERAL)
    	{
    		g_AdvInstance.adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
    	}

    	g_AdvInstance.adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED;
    	g_AdvInstance.adv_data.scan_rsp_data.len = BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED;
    }
    else
    {
    	if (pCfg->Role & BLEAPP_ROLE_BROADCASTER)
    	{
    		g_AdvInstance.adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;//BLE_GAP_ADV_TYPE_ADV_NONCONN_IND;
    	}
    	if (pCfg->Role & BLEAPP_ROLE_PERIPHERAL)
    	{
    		g_AdvInstance.adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;//BLE_GAP_ADV_TYPE_ADV_NONCONN_IND;
    	}
    	g_AdvInstance.adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;
    	g_AdvInstance.adv_data.scan_rsp_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;
   }

    if (pCfg->pAdvManData != NULL)
    {
		g_BleAppData.ManufData.company_identifier = pCfg->VendorID;
		g_BleAppData.ManufData.data.p_data = (uint8_t*)pCfg->pAdvManData;
		g_BleAppData.ManufData.data.size = pCfg->AdvManDataLen;
    }
    if (pCfg->pSrManData != NULL)
    {
		g_BleAppData.SRManufData.company_identifier = pCfg->VendorID;
		g_BleAppData.SRManufData.data.p_data = (uint8_t*)pCfg->pSrManData;
		g_BleAppData.SRManufData.data.size = pCfg->SrManDataLen;
    }
    // Build advertising data struct to pass into @ref ble_advertising_init.

    if (pCfg->Appearance != BLE_APPEARANCE_UNKNOWN)
    {
    	initdata.advdata.include_appearance = true;
    }

    if (pCfg->AdvTimeout != 0)
    {
        // ADV for a limited time, use this flag
        initdata.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    }
    else
    {
        // Always ADV use this flag
        initdata.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    }

