IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_dev_nrf52.cpp
    if (pCfg->pDevName != NULL)
    {
    	if (strlen(pCfg->pDevName) > 30)
    	{
    		initdata.advdata.name_type      = BLE_ADVDATA_SHORT_NAME;
    		initdata.advdata.short_name_len = 30;//strlen(pCfg->pDevName);
    	}
    	else
    	{
    		initdata.advdata.name_type = BLE_ADVDATA_FULL_NAME;
    		initdata.advdata.short_name_len = strlen(pCfg->pDevName);
    	}
    }
    else
    {
    		initdata.advdata.name_type = BLE_ADVDATA_NO_NAME;
    }

	ble_uuid_t uid[MAX_ADV_UUID];

	if (pCfg->pAdvUuid != NULL)
    {
		if (pCfg->pAdvUuid->Type == BLE_UUID_TYPE_16)
		{
			uint8_t utype = pCfg->pAdvUuid->BaseIdx == 0 ?
							BLE_UUID_TYPE_BLE : BLE_UUID_TYPE_VENDOR_BEGIN;
			for (int i = 0; i < min(pCfg->pAdvUuid->Count, MAX_ADV_UUID); i++)
			{
				uid[i].uuid = pCfg->pAdvUuid->Val[i].Uuid16;
				uid[i].type = utype;
			}
		}
    }

	if (pCfg->bExtAdv)
	{
        if (pCfg->pAdvUuid != NULL)
        {
			if (pCfg->bCompleteUuidList)
			{
				initdata.advdata.uuids_complete.uuid_cnt = pCfg->pAdvUuid->Count;
				initdata.advdata.uuids_complete.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
			}
			else
			{
				initdata.advdata.uuids_more_available.uuid_cnt = pCfg->pAdvUuid->Count;
				initdata.advdata.uuids_more_available.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
			}
        }
		if (pCfg->pAdvManData != NULL)
		{
			initdata.advdata.p_manuf_specific_data = &g_BleAppData.ManufData;
		}
	}
	else
	{
		if (initdata.advdata.name_type == BLE_ADVDATA_NO_NAME)
		{
			if (pCfg->pAdvUuid != NULL)
			{
				if (pCfg->pAdvManData != NULL)
				{
					initdata.advdata.p_manuf_specific_data = &g_BleAppData.ManufData;

					if (pCfg->bCompleteUuidList)
					{
						initdata.srdata.uuids_complete.uuid_cnt = pCfg->pAdvUuid->Count;
						initdata.srdata.uuids_complete.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
					}
					else
					{
						initdata.srdata.uuids_more_available.uuid_cnt = pCfg->pAdvUuid->Count;
						initdata.srdata.uuids_more_available.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
					}
				}
				else
				{
					if (pCfg->bCompleteUuidList)
					{
						initdata.advdata.uuids_complete.uuid_cnt = pCfg->pAdvUuid->Count;
						initdata.advdata.uuids_complete.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
					}
					else
					{
						initdata.advdata.uuids_more_available.uuid_cnt = pCfg->pAdvUuid->Count;
						initdata.advdata.uuids_more_available.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
					}
					if (pCfg->pSrManData != NULL)
					{
						initdata.srdata.p_manuf_specific_data = &g_BleAppData.SRManufData;
					}
				}
			}
			else
			{
				if (pCfg->pAdvManData != NULL)
				{
					initdata.advdata.p_manuf_specific_data = &g_BleAppData.ManufData;
				}
				if (pCfg->pSrManData != NULL)
				{
					initdata.srdata.p_manuf_specific_data = &g_BleAppData.SRManufData;
				}
			}
		}
		else
		{
			if (pCfg->pAdvUuid != NULL)
			{
				if (pCfg->bCompleteUuidList)
				{
					initdata.srdata.uuids_complete.uuid_cnt = pCfg->pAdvUuid->Count;
					initdata.srdata.uuids_complete.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
				}
				else
				{
					initdata.srdata.uuids_more_available.uuid_cnt = pCfg->pAdvUuid->Count;
					initdata.srdata.uuids_more_available.p_uuids  = uid;//(ble_uuid_t*)pCfg->pAdvUuids;
				}

				if (pCfg->pAdvManData != NULL)
				{
					initdata.advdata.p_manuf_specific_data = &g_BleAppData.ManufData;
				}

			}
			else
			{
				if (pCfg->pAdvManData != NULL)
				{
					initdata.advdata.p_manuf_specific_data = &g_BleAppData.ManufData;
				}
				if (pCfg->pSrManData != NULL)
				{
					initdata.srdata.p_manuf_specific_data = &g_BleAppData.SRManufData;
				}
			}
		}
	}

    err_code = ble_advdata_encode(&initdata.advdata, g_AdvInstance.adv_data.adv_data.p_data, &g_AdvInstance.adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    //if (pCfg->pSrManData)
    {
    	err_code = ble_advdata_encode(&initdata.srdata, g_AdvInstance.adv_data.scan_rsp_data.p_data, &g_AdvInstance.adv_data.scan_rsp_data.len);
    	APP_ERROR_CHECK(err_code);
    }

    memcpy(&g_BleAppData.AdvData, &initdata.advdata, sizeof(ble_advdata_t));
    memcpy(&g_BleAppData.SrData, &initdata.srdata, sizeof(ble_advdata_t));

    err_code = sd_ble_gap_adv_set_configure(&g_AdvInstance.adv_handle, &g_AdvInstance.adv_data, &g_AdvInstance.adv_params);
    APP_ERROR_CHECK(err_code);

    g_AdvInstance.initialized = true;
#endif

    return true;
}

void BtDevDisInit(const BtDevCfg_t *pCfg)
{
    ble_dis_init_t   dis_init;
    ble_dis_pnp_id_t pnp_id;

    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

	if (pCfg->pDevInfo)
	{
		ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char*)pCfg->pDevInfo->ManufName);
		ble_srv_ascii_to_utf8(&dis_init.model_num_str, (char*)pCfg->pDevInfo->ModelName);
		if (pCfg->pDevInfo->pSerialNoStr)
			ble_srv_ascii_to_utf8(&dis_init.serial_num_str, (char*)pCfg->pDevInfo->pSerialNoStr);
		if (pCfg->pDevInfo->pFwVerStr)
			ble_srv_ascii_to_utf8(&dis_init.fw_rev_str, (char*)pCfg->pDevInfo->pFwVerStr);
		if (pCfg->pDevInfo->pHwVerStr)
			ble_srv_ascii_to_utf8(&dis_init.hw_rev_str, (char*)pCfg->pDevInfo->pHwVerStr);
	}

    pnp_id.vendor_id_source = BLE_DIS_VENDOR_ID_SRC_BLUETOOTH_SIG;
    pnp_id.vendor_id  = pCfg->VendorId;
    pnp_id.product_id = pCfg->ProductId;
    dis_init.p_pnp_id = &pnp_id;

    //BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    //BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

    switch (pCfg->SecType)
    {
    	case BTDEV_SECTYPE_STATICKEY_NO_MITM:
    	    dis_init.dis_char_rd_sec = SEC_JUST_WORKS;
    		break;
    	case BTDEV_SECTYPE_STATICKEY_MITM:
    	    dis_init.dis_char_rd_sec = SEC_MITM;
    		break;
    	case BTDEV_SECTYPE_LESC_MITM:
    	    dis_init.dis_char_rd_sec = SEC_JUST_WORKS;
    		break;
    	case BTDEV_SECTYPE_SIGNED_NO_MITM:
    	    dis_init.dis_char_rd_sec = SEC_SIGNED;
    		break;
    	case BTDEV_SECTYPE_SIGNED_MITM:
    	    dis_init.dis_char_rd_sec = SEC_SIGNED_MITM;
    		break;
    	case BTDEV_SECTYPE_NONE:
    	default:
    	    dis_init.dis_char_rd_sec = SEC_OPEN;
    	    break;
    }

    uint32_t err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);

