IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_dev_nrf52.cpp
}

uint16_t BleAppGetConnHandle()
{
	return s_BtDevnRF5.ConnHdl;
}

/**@brief Function for handling events from the GATT library. */
void BleGattEvtHandler(nrf_ble_gatt_t * p_gatt, const nrf_ble_gatt_evt_t * p_evt)
{
    if ((s_BtDevnRF5.ConnHdl == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
    	//g_BleAppData.MaxMtu = p_evt->params.att_mtu_effective - 3;//OPCODE_LENGTH - HANDLE_LENGTH;
       // m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        //NRF_LOG_INFO("Data len is set to 0x%X(%d)\r\n", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
 //   printf("ATT MTU exchange completed. central 0x%x peripheral 0x%x\r\n", p_gatt->att_mtu_desired_central, p_gatt->att_mtu_desired_periph);
}

/**@brief Function for initializing the GATT library. */
void BtDevGattInit(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&s_Gatt, BleGattEvtHandler);
    APP_ERROR_CHECK(err_code);

    if (s_BtDevnRF5.Role & BTDEV_ROLE_PERIPHERAL)
    {
    	err_code = nrf_ble_gatt_att_mtu_periph_set(&s_Gatt, s_BtDevnRF5.MaxMtu);
    	APP_ERROR_CHECK(err_code);

    	if (s_BtDevnRF5.MaxMtu >= 27)
    	{
    		// 251 bytes is max dat length as per Bluetooth core spec 5, vol 6, part b, section 4.5.10
    		// 27 - 251 bytes is hardcoded in nrf_ble_gat of the SDK.
    		uint8_t dlen = s_BtDevnRF5.MaxMtu > 254 ? 251: s_BtDevnRF5.MaxMtu - 3;
    		err_code = nrf_ble_gatt_data_length_set(&s_Gatt, BLE_CONN_HANDLE_INVALID, dlen);
    		APP_ERROR_CHECK(err_code);
    	}
      	ble_opt_t opt;

      	memset(&opt, 0x00, sizeof(opt));
      	opt.common_opt.conn_evt_ext.enable = 1;

      	err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
      	APP_ERROR_CHECK(err_code);
    }

    if (s_BtDevnRF5.Role & BTDEV_ROLE_CENTRAL)
    {
    	err_code = nrf_ble_gatt_att_mtu_central_set(&s_Gatt, s_BtDevnRF5.MaxMtu);
    	APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling File Data Storage events.
 *
 * @param[in] p_evt  Peer Manager event.
 * @param[in] cmd
 */
static void fds_evt_handler(fds_evt_t const * const p_fds_evt)
{
    if (p_fds_evt->id == FDS_EVT_GC)
    {
//        printf("GC completed");
    }
}

bool BtDevConnectable(const BtDevCfg_t *pCfg, bool bEraseBond)
{
	uint32_t err_code;

    //BleAppInitUserData();

	BtDevGapParamInit(pCfg);

	//gatt_init();

//	if (pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT)
   // if (pBleAppCfg->AdvType != BLEADV_TYPE_ADV_NONCONN_IND)
	if (pCfg->Role & BTDEV_ROLE_PERIPHERAL)
		conn_params_init();

	BtDevInitCustomSrvc();

	//if (pBleAppCfg->bEnDevInfoService)
	if (pCfg->pDevInfo != NULL)
		BtDevDisInit(pCfg);

	return true;
}


int8_t GetValidTxPower(int TxPwr)
{
	int8_t retval = s_TxPowerdBm[0];

	for (int i = 1; i < s_NbTxPowerdBm; i++)
	{
		if (s_TxPowerdBm[i] > TxPwr)
			break;

		retval = s_TxPowerdBm[i];
	}

	return retval;
}
/*
uint32_t GetLFAccuracy(uint32_t AccPpm)
{
	uint32_t retval = 0;

	if (AccPpm < 2)
	{
		retval = 11;
	}
	else if (AccPpm < 5)
	{
		retval = 10;
	}
	else if (AccPpm < 10)
	{
		retval = 9;
	}
	else if (AccPpm < 20)
	{
		retval = 8;
	}
	else if (AccPpm < 30)
	{
		retval = 7;
	}
	else if (AccPpm < 50)
	{
		retval = 6;
	}
	else if (AccPpm < 75)
	{
		retval = 5;
	}
	else if (AccPpm < 100)
	{
		retval = 4;
	}
	else if (AccPpm < 150)
	{
		retval = 3;
	}
	else if (AccPpm < 250)
	{
		retval = 2;
	}
	else if (AccPpm < 500)
	{
		retval = 0;
	}
	else
	{
		retval = 1;
	}

	return retval;
}
*/
/**
 * @brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
bool BtDevInit(const BtDevCfg_t *pCfg)//, bool bEraseBond)
{
	ret_code_t err_code;

	s_BtDevnRF5.State = BTDEV_STATE_UNKNOWN;
	s_BtDevnRF5.Role = pCfg->Role;
	s_BtDevnRF5.AdvHdl = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    s_BtDevnRF5.ConnHdl = BLE_CONN_HANDLE_INVALID;
	s_BtDevnRF5.bExtAdv = pCfg->bExtAdv;
	s_BtDevnRF5.bScan = false;
	//s_BtDevnRF5.bAdvertising = false;
	s_BtDevnRF5.VendorId = pCfg->VendorId;
	s_BtDevnRF5.ProductId = pCfg->ProductId;
	s_BtDevnRF5.ProductVer = pCfg->ProductVer;
	s_BtDevnRF5.Appearance = pCfg->Appearance;
//	s_BtDevnRF5.pSrvc = nullptr;

#if 0
	s_BtDevnRF5.ConnLedPort = pCfg->ConnLedPort;
	s_BtDevnRF5.ConnLedPin = pCfg->ConnLedPin;
	s_BtDevnRF5.ConnLedActLevel = pCfg->ConnLedActLevel;

	if (pCfg->ConnLedPort != -1 && pCfg->ConnLedPin != -1)
    {
		IOPinConfig(pCfg->ConnLedPort, pCfg->ConnLedPin, 0,
					IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);

		BtDevConnLedOff();
    }
#endif

    if (pCfg->MaxMtu > NRF_BLE_MAX_MTU_SIZE)
    	s_BtDevnRF5.MaxMtu = pCfg->MaxMtu;
    else
    	s_BtDevnRF5.MaxMtu = NRF_BLE_MAX_MTU_SIZE;
    app_timer_init();

	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);

//    nrf_ble_lesc_init();
#if 0
    nrf_clock_lf_cfg_t lfclk = {
    	0
    };

	OscDesc_t const *lfosc = GetLowFreqOscDesc();
	if (lfosc->Type == OSC_TYPE_RC)
	{
		lfclk.source = NRF_CLOCK_LF_SRC_RC;
		lfclk.rc_ctiv = 16;
		lfclk.rc_temp_ctiv = 2;
	}
	else
	{
		lfclk.accuracy = GetLFAccuracy(lfosc->Accuracy);
		lfclk.source = NRF_CLOCK_LF_SRC_XTAL;
	}

	err_code = nrf_sdh_enable(&lfclk);//(nrf_clock_lf_cfg_t *)&pBleAppCfg->ClkCfg);
    APP_ERROR_CHECK(err_code);

    // Initialize SoftDevice.
    BtAppStackInit(pCfg->CentLinkCount, pCfg->PeriLinkCount,
    				pCfg->Role & BTDEV_ROLE_PERIPHERAL);
    				//pBleAppCfg->AdvType != BLEADV_TYPE_ADV_NONCONN_IND);
//    				pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT);

    //err_code = ble_lesc_init();
    //APP_ERROR_CHECK(err_code);
#endif

	if (pCfg->PeriLinkCount > 0 && pCfg->AdvInterval > 0)
	{
		//g_BleAppData.AppRole |= BLEAPP_ROLE_PERIPHERAL;

		if (pCfg->pDevName != NULL)
	    {
			int l = strlen(pCfg->pDevName);
	        err_code = sd_ble_gap_device_name_set(&s_gap_conn_mode,
	                                          (const uint8_t *) pCfg->pDevName,
	                                          min(l, 30));
	        APP_ERROR_CHECK(err_code);
	    }
	    err_code = sd_ble_gap_appearance_set(pCfg->Appearance);
	    APP_ERROR_CHECK(err_code);
	}

    if (pCfg->Role & BTDEV_ROLE_PERIPHERAL)
    {
//    	BtDevConnectable(pCfg, false);//bEraseBond);
    	BtDevGapParamInit(pCfg);

  		conn_params_init();

    	BtDevInitCustomSrvc();

