IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_dev_nrf52.cpp
    	if (pCfg->pDevInfo != NULL)
    		BtDevDisInit(pCfg);
    }

    if (pCfg->CentLinkCount > 0)
	{
//		g_BleAppData.AppRole |= BLEAPP_ROLE_CENTRAL;
//		ret_code_t err_code = ble_db_discovery_init(BleAppDBDiscoveryHandler);
//		APP_ERROR_CHECK(err_code);
    }

    BtDevGattInit();

    BtDevInitCustomData();

    BtDevPeerMngrInit(pCfg->SecType, pCfg->SecExchg, false);//bEraseBond);


    s_BtDevnRF5.bSecure = pCfg->SecType != BTDEV_SECTYPE_NONE;

   // err_code = fds_register(fds_evt_handler);
   // APP_ERROR_CHECK(err_code);

    // Generate the ECDH key pair and set public key in the peer-manager.
    //err_code = ble_lesc_ecc_keypair_generate_and_set();
    //APP_ERROR_CHECK(err_code);

    if (s_BtDevnRF5.Role & (BTDEV_ROLE_PERIPHERAL | BTDEV_ROLE_BROADCASTER))
    {
        if (BtDevAdvInit(pCfg) == false)
        {
        	return false;
        }

        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, s_BtDevnRF5.AdvHdl, GetValidTxPower(pCfg->TxPower));
        APP_ERROR_CHECK(err_code);
        BtGapInit(s_BtDevnRF5.Role);
    }
    else
    {
        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, s_BtDevnRF5.AdvHdl, GetValidTxPower(pCfg->TxPower));
        APP_ERROR_CHECK(err_code);
    }
#if 0
#if (__FPU_USED == 1)
    // Patch for softdevice & FreeRTOS to sleep properly when FPU is in used
    NVIC_SetPriority(FPU_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_ClearPendingIRQ(FPU_IRQn);
    NVIC_EnableIRQ(FPU_IRQn);
#endif

    if (AppEvtHandlerInit(pCfg->pEvtHandlerQueMem, pCfg->EvtHandlerQueMemSize) == false)
    {
    	return false;
    }
#endif
    s_BtDevnRF5.State = BTDEV_STATE_INITIALIZED;

   // NRF_SDH_BLE_OBSERVER(g_BtDevObserver, BLEAPP_OBSERVER_PRIO, ble_evt_dispatch, (void*)pCfg);

    return true;
}

#if 0
bool BtDevAddSrvc(BtGattSrvc_t * const pSrvc, const BtGattSrvcCfg_t *pSrvcCfg)
{
	if (pSrvcCfg == nullptr)
	{
		return false;
	}

	bool res = BtGattSrvcAdd(pSrvc, pSrvcCfg);

	if (res)
	{
		pSrvc->pPrev = nullptr;
		pSrvc->pNext = s_BtDevnRF5.pSrvc;

		if (s_BtDevnRF5.pSrvc)
		{
			s_BtDevnRF5.pSrvc->pPrev = pSrvc;
		}
		s_BtDevnRF5.pSrvc = pSrvc;
	}

	return true;
}
#endif

#if 0
void BleAppScan()
{
	ret_code_t err_code;

	if (g_BleAppData.bScan == true)
	{
		err_code = sd_ble_gap_scan_start(NULL, &g_BleScanReportData);
	}
	else
	{
	    g_BleAppData.bScan = true;

		err_code = sd_ble_gap_scan_start(&s_BleScanParams, &g_BleScanReportData);
	}
	APP_ERROR_CHECK(err_code);
}

void BleAppScanStop()
{
	if (s_BtDevDatanRF5.bScan == true)
	{
		ret_code_t err_code = sd_ble_gap_scan_stop();
		APP_ERROR_CHECK(err_code);
		g_BleAppData.bScan = false;
	}
}

bool BleAppScanInit(BleAppScanCfg_t *pCfg)
{
	if (pCfg == NULL)
	{
		return false;
	}

	s_BleScanParams.timeout = pCfg->Timeout;
	s_BleScanParams.window = pCfg->Duration;
	s_BleScanParams.interval = pCfg->Interval;

    uint8_t uidtype = BLE_UUID_TYPE_VENDOR_BEGIN;

    ble_uuid128_t uid;

    memcpy(uid.uuid128, pCfg->BaseUid, 16);

    ret_code_t err_code = sd_ble_uuid_vs_add(&uid, &uidtype);
    APP_ERROR_CHECK(err_code);

    g_BleAppData.bScan = true;

	err_code = sd_ble_gap_scan_start(&s_BleScanParams, &g_BleScanReportData);
	APP_ERROR_CHECK(err_code);

	return err_code == NRF_SUCCESS;
}

bool BleAppScanInit(ble_uuid128_t * const pBaseUid, ble_uuid_t * const pServUid)
{
    ble_uuid128_t base_uid = *pBaseUid;
    uint8_t uidtype = BLE_UUID_TYPE_VENDOR_BEGIN;

    ret_code_t err_code = sd_ble_uuid_vs_add(&base_uid, &uidtype);
    APP_ERROR_CHECK(err_code);

    //ble_db_discovery_evt_register(pServUid);
    s_BtDevDatanRF5.bScan = true;

	err_code = sd_ble_gap_scan_start(&s_BleScanParams, &g_BleScanReportData);
	APP_ERROR_CHECK(err_code);

	return err_code == NRF_SUCCESS;
}

//bool BleAppConnect(ble_gap_addr_t * const pDevAddr, ble_gap_conn_params_t * const pConnParam)
uint32_t BleAppConnect(ble_gap_addr_t * const pDevAddr, ble_gap_conn_params_t * const pConnParam)
{
	ret_code_t err_code = sd_ble_gap_connect(pDevAddr, &s_BleScanParams,
                                  	  	  	 pConnParam,
											 BLEAPP_CONN_CFG_TAG);
    //APP_ERROR_CHECK(err_code);

	s_BtDevnRF5.bScan = false;

    //return err_code == NRF_SUCCESS;
    return err_code;
}

bool BleAppEnableNotify(uint16_t ConnHandle, uint16_t CharHandle)//ble_uuid_t * const pCharUid)
{
    uint32_t                 err_code;
    ble_gattc_write_params_t write_params;
    uint8_t                  buf[BLE_CCCD_VALUE_LEN];

    buf[0] = BLE_GATT_HVX_NOTIFICATION;
    buf[1] = 0;

    write_params.write_op = BLE_GATT_OP_WRITE_CMD;//BLE_GATT_OP_WRITE_REQ;
    write_params.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
    write_params.handle   = CharHandle;
    write_params.offset   = 0;
    write_params.len      = sizeof(buf);
    write_params.p_value  = buf;

    err_code = sd_ble_gattc_write(ConnHandle, &write_params);

    return err_code == NRF_SUCCESS;
}

bool BleAppWrite(uint16_t ConnHandle, uint16_t CharHandle, uint8_t *pData, uint16_t DataLen)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID || CharHandle == BLE_CONN_HANDLE_INVALID)
	{
		return false;
	}

    ble_gattc_write_params_t const write_params =
    {
        .write_op = BLE_GATT_OP_WRITE_CMD,
        .flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
        .handle   = CharHandle,
        .offset   = 0,
        .len      = DataLen,
        .p_value  = pData
    };

    return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}
#endif
//NRF_SDH_BLE_OBSERVER(g_BtDevObserver, BLEAPP_OBSERVER_PRIO, ble_evt_dispatch, NULL);

#if 0
/**@brief   Function for polling SoftDevice events.
 *
 * @note    This function is compatible with @ref app_sched_event_handler_t.
 *
 * @param[in]   p_event_data Pointer to the event data.
 * @param[in]   event_size   Size of the event data.
 */
static void appsh_events_poll(void * p_event_data, uint16_t event_size)
{
    nrf_sdh_evts_poll();

    UNUSED_PARAMETER(p_event_data);
    UNUSED_PARAMETER(event_size);
}

extern "C" void SD_EVT_IRQHandler(void)
{
	// Notify any RTOS waiter then drain SoftDevice events so NRF_SDH observers run.
	// RTOS apps provide a strong BtAppEvtNotify() that wakes their BLE task; the
	// weak default is empty so bare-metal apps simply fall through to the poll.
	BtAppEvtNotify();
	nrf_sdh_evts_poll();
}

void BtGattSrvcDisconnected(BtGattSrvc_t *pSrvc)
{

}


// We need this here in order for the Linker to keep the nrf_sdh_soc.c
// which is require for Softdevice to function properly
// Create section set "sdh_soc_observers".
// This is needed for FSTORAGE event to work.
NRF_SDH_STACK_OBSERVER(m_nrf_sdh_soc_evts_poll, NRF_SDH_SOC_STACK_OBSERVER_PRIO) = {
    .handler   = nrf_sdh_soc_evts_poll,
    .p_context = NULL,
};

#ifndef __ARMCC_VERSION

#if NRF_MODULE_ENABLED(NRF_CRYPTO) && NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_CC310)
extern nrf_crypto_backend_info_t const cc310_backend;
// Just to make the linker to keep the nrf_hw_backend
__attribute__ ((used)) static uint32_t s_pcc310_backend_info = (uint32_t)&cc310_backend;
#endif

#if NRF_MODULE_ENABLED(NRF_CRYPTO) && NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_NRF_HW_RNG)
extern nrf_crypto_backend_info_t const nrf_hw_backend;
// Just to make the linker to keep the nrf_hw_backend
__attribute__ ((used)) static uint32_t s_pnrf_hw_backend_info = (uint32_t)&nrf_hw_backend;
#endif

#endif
#endif
